/*
  react - библиготека предназначенная для создания UI, имеющая простой шаблон и хорошую гибкость.

  component - сомодостаточный элемент, готовый к использоваиню

  fragment - обёртка (<Fragment></Fragment> - <></>) key можно повесить только на <Fragment></Fragment>

  props - входные данные компонента, передаются от родителя

  state - состояние компонента, следит за динамической частью

  lifecycle - 
  
  immutability (неизменяемый) - запрет на мутирование элемента после внесения, (изменить старый и вставить новый).

*/
